app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "millo"], ["password_digest", "[FILTERED]"], ["email", "mil@ymail.com"], ["created_at", "2023-03-23 03:16:23.850716"], ["updated_at", "2023-03-23 03:16:23.850716"]]
---
  def create
    user= User.create!(user_params)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
  def show
    user=User.find(session[:user_id])